RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
/*******************************************************************************
* Function Name: Cy_PRA_WcoInit
****************************************************************************//**
*
* Initializes Watch Crystal Oscillator.
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS WCO init is success.
* CY_PRA_STATUS_ERROR_PROCESSING_WCO WCO init is failure.
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_WcoInit(const cy_stc_pra_system_config_t *devConfig)
{
    if ((devConfig->wcoInPort != NULL) && (devConfig->wcoOutPort != NULL))
    {
        Cy_GPIO_Pin_FastInit(devConfig->wcoInPort , devConfig->wcoInPinNum, 0x00U, 0x00U, HSIOM_SEL_GPIO);
        Cy_GPIO_Pin_FastInit(devConfig->wcoOutPort , devConfig->wcoOutPinNum, 0x00U, 0x00U, HSIOM_SEL_GPIO);
    }
    if (devConfig->bypassEnable)
    {
        Cy_SysClk_WcoBypass(CY_SYSCLK_WCO_BYPASSED);
    }
    else
    {
        Cy_SysClk_WcoBypass(CY_SYSCLK_WCO_NOT_BYPASSED);
    }

    if (CY_SYSCLK_SUCCESS != Cy_SysClk_WcoEnable(CY_PRA_WCO_ENABLE_TIMEOUT))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_WCO;
    }

    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_PowerInit
****************************************************************************//**
*
* Initializes Power
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS Power init is success.
* CY_PRA_STATUS_ERROR_PROCESSING_PWR Power init is failure.
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_PowerInit(const cy_stc_pra_system_config_t *devConfig)
{
    if (devConfig->ldoEnable)
    {
        /* LDO valid voltage */
        if ((devConfig->ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V) ||
            (devConfig->ldoVoltage == CY_SYSPM_LDO_VOLTAGE_1_1V))
            {
                if (CY_SYSPM_SUCCESS != Cy_SysPm_LdoSetVoltage(devConfig->ldoVoltage))
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
                }
            }
    }
    else
    {
        if ((devConfig->buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_0_9V) ||
            (devConfig->buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_1_1V))
            {
                if (CY_SYSPM_SUCCESS != Cy_SysPm_BuckEnable(devConfig->buckVoltage))
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
                }
            }
    }

    if (devConfig->pwrCurrentModeMin)
    {
        /* Sets the system into Minimum current mode of the core regulator */
        if (CY_SYSPM_SUCCESS != Cy_SysPm_SystemSetMinRegulatorCurrent())
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
        }
    }
    else
    {
        /* Sets the system into Normal current mode of the core regulator */
        if (CY_SYSPM_SUCCESS != Cy_SysPm_SystemSetNormalRegulatorCurrent())
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
        }
    }

    /* Configures PMIC */
    Cy_SysPm_UnlockPmic();
    if (devConfig->pmicEnable)
    {
        Cy_SysPm_PmicEnableOutput();
    }
    else
    {
        Cy_SysPm_PmicDisableOutput();
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputPathMuxFrq
****************************************************************************//**
*
* Gets Source clock frequency for the path mux.
*
* \param pathMuxSrc The source clock for PATH_MUX.
* \param devConfig System Configuration Parameter
*
* \return
* Returns the source frequency of the path mux.
*
*******************************************************************************/
static uint32_t Cy_PRA_GetInputPathMuxFrq(cy_en_clkpath_in_sources_t pathMuxSrc, const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY; /* Hz */

    switch (pathMuxSrc)
    {
        case CY_SYSCLK_CLKPATH_IN_IMO:
        {
            srcFreq = CY_PRA_IMO_SRC_FREQUENCY; /* IMO Freq = 8 MHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_EXT:
        {
            srcFreq = devConfig->extClkFreqHz;
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ECO:
        {
            srcFreq = devConfig->ecoFreqHz;
        }
        break;
#if defined(CY_IP_MXBLESS)
        case CY_SYSCLK_CLKPATH_IN_ALTHF:
        {
            (devConfig->altHFclkFreq == (uint32_t)CY_BLE_BLESS_ECO_FREQ_32MHZ) ? (srcFreq = CY_PRA_ALTHF_FREQ_32MHZ) : (srcFreq = CY_PRA_ALTHF_FREQ_16MHZ);
        }
        break;
#endif
        case CY_SYSCLK_CLKPATH_IN_ILO:
        {
            srcFreq = CY_PRA_ILO_SRC_FREQUENCY; /* ILO Freq = 32 KHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_WCO:
        {
            srcFreq = CY_PRA_WCO_SRC_FREQUENCY; /* WCO Freq = 32.768 KHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_PILO:
        {
            if(CY_SRSS_PILO_PRESENT)
            {
                srcFreq = CY_PRA_PILO_SRC_FREQUENCY; /* PILO Freq = 32.768 KHz */
            }
        }
        break;
        default:
        {
            srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }
        break;
    } /* End Switch */

    return srcFreq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputSourceFreq
****************************************************************************//**
*
* Gets the source clock frequency for the clock path. This function is called from the HF
* level.
*
* \param clkPath Clock Path
* \param devConfig System Configuration Parameter
* \param srcFreq The source frequency of the clock path which is updated in this function.
*
* \return
* CY_PRA_STATUS_SUCCESS If the frequency is updated.
* CY_PRA_STATUS_INVALID_PARAM If clkpaht is not the valid path.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_GetInputSourceFreq(uint32_t clkPath, const cy_stc_pra_system_config_t *devConfig, uint32_t *srcFreq )
{
    cy_en_pra_status_t status = CY_PRA_STATUS_INVALID_PARAM;
    *srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if(clkPath >= CY_SRSS_NUM_CLKPATH)
    {
        return status;
    }

    switch (clkPath)
    {
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH0: /* CLK_PATH0 */
        {
            if (devConfig->path0Enable)
            {
                /* Checks for FLL, if FLL is enabled, returns the FLL output frequency */
                if ((devConfig->fllEnable) && (devConfig->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->fllOutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH1: /* CLK_PATH1 */
        {
            if (devConfig->path1Enable)
            {
                /* Checks for PLL0, if PLL0 is enabled, returns the PLL0 output frequency */
                if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (devConfig->pll0Enable) && (devConfig->pll0OutputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->pll0OutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path1Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH2: /* CLK_PATH2 */
        {
            if (devConfig->path2Enable)
            {
                /* Checks for PLL1, if PLL1 is enabled, returns the PLL1 output frequency */
                if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (devConfig->pll1Enable) && (devConfig->pll1OutputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->pll1OutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path2Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH3: /* CLK_PATH3 */
        {
            if (devConfig->path3Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path3Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH4: /* CLK_PATH4 */
        {
            if (devConfig->path4Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path4Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH5: /* CLK_PATH5 */
        {
            if (devConfig->path5Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path5Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        default:
        {
            *srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }
        break;
    }

