RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    return status;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetHF0FreqHz
****************************************************************************//**
*
* Get HF0 frequency in Hz. When HF0 is sourced from LF clocks then the output
* frequency of HF0 is "0" in MHz. So HF0 output frequency has to be calculated
* and returned in Hz.
*
* \param devConfig System Configuration Parameter
*
* \return HF0 frequency in Hz
*
*******************************************************************************/
static uint32_t Cy_PRA_GetHF0FreqHz(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t retFreq;
    /* if HF0 output frequency is 0, then calculate HF0 output frequency from HF_PATH frequency */
    if (devConfig->hf0OutFreqMHz != 0UL)
    {
        retFreq = (devConfig->hf0OutFreqMHz * CY_PRA_FREQUENCY_HZ_CONVERSION);
    }
    else
    {
        retFreq = CY_SYSLIB_DIV_ROUND(Cy_SysClk_ClkPathGetFrequency((uint32_t) devConfig->hf0Source),(1UL << ((uint32_t)devConfig->hf0Divider)));
    }

    return retFreq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetClkLfFreq
****************************************************************************//**
*
* Gets Low-Frequency Clock (CLK_LF).
*
* \param devConfig System Configuration Parameter
*
* \return CLK_LF The frequency.
*
*******************************************************************************/
static uint32_t Cy_PRA_GetClkLfFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if (devConfig->clkLFEnable)
    {
        switch (devConfig->clkLfSource)
        {
            case CY_SYSCLK_CLKLF_IN_ILO:
            {
                if (devConfig->iloEnable)
                {
                    freq = CY_PRA_ILO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_CLKLF_IN_WCO:
            {
                if (devConfig->wcoEnable)
                {
                    freq = CY_PRA_WCO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_CLKLF_IN_PILO:
            {
                if ((devConfig->piloEnable) && (CY_SRSS_PILO_PRESENT))
                {
                    freq = CY_PRA_PILO_SRC_FREQUENCY;
                }
            }
            break;
            default:
            {
                freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
            }
            break;
        } /* End Switch */
    }

    return freq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetClkBakFreq
****************************************************************************//**
*
* Gets the BAK Clock (CLK_BAK) frequency.
*
* \param devConfig System Configuration Parameter
*
* \return CLK_LF The frequency.
*
*******************************************************************************/
static uint32_t Cy_PRA_GetClkBakFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if (devConfig->clkBakEnable)
    {
        switch (devConfig->clkBakSource)
        {
            case CY_SYSCLK_BAK_IN_WCO:
            {
                if (devConfig->wcoEnable)
                {
                    freq = CY_PRA_WCO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_BAK_IN_CLKLF:
            {
                if (devConfig->clkLFEnable)
                {
                    freq = Cy_PRA_GetClkLfFreq(devConfig);
                }
            }
            break;
            default:
            {
                freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
            }
            break;
        } /* End Switch */
    }

    return freq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputSourceClock
****************************************************************************//**
*
* Gets the source clock for the clock path.
*
* \param clkPath Clock Path
* \param devConfig System Configuration Parameter
* \param status
*        CY_PRA_STATUS_SUCCESS for valid input configuration
*        CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
* \return
* Returns the source clock.
*
*******************************************************************************/
static cy_en_clkpath_in_sources_t Cy_PRA_GetInputSourceClock(uint32_t clkPath, const cy_stc_pra_system_config_t *devConfig, cy_en_pra_status_t *status)
{
    cy_en_clkpath_in_sources_t srcClock = CY_SYSCLK_CLKPATH_IN_IMO;

    if(clkPath >= CY_SRSS_NUM_CLKPATH)
    {
        *status = CY_PRA_STATUS_INVALID_PARAM;
        return srcClock;
    }

    *status = CY_PRA_STATUS_INVALID_PARAM;

    switch (clkPath)
    {
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH0: /* CLK_PATH0 */
        {
            if (devConfig->path0Enable) /* Checks for PATH_MUX0 enable/disable */
            {
                srcClock = devConfig->path0Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH1: /* CLK_PATH1 */
        {
            if (devConfig->path1Enable) /* Checks for PATH_MUX1 enable/disable */
            {
                srcClock = devConfig->path1Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH2: /* CLK_PATH2 */
        {
            if (devConfig->path2Enable) /* Checks for PATH_MUX2 enable/disable */
            {
                srcClock = devConfig->path2Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH3: /* CLK_PATH3 */
        {
            if (devConfig->path3Enable) /* Checks for PATH_MUX3 enable/disable */
            {
                srcClock = devConfig->path3Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH4: /* CLK_PATH4 */
        {
            if (devConfig->path4Enable) /* Checks for PATH_MUX4 enable/disable */
            {
                srcClock = devConfig->path4Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH5: /* CLK_PATH5 */
        {
            if (devConfig->path5Enable) /* Checks for PATH_MUX5 enable/disable */
            {
                srcClock = devConfig->path5Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        default:
        {
            /* Returns CY_PRA_STATUS_INVALID_PARAM */
        }
        break;
    }

