RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    return srcClock;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateECO
****************************************************************************//**
*
* Validates the ECO.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_ECO For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateECO(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    if ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (devConfig->ecoEnable))
    {
        if (((devConfig->ecoFreqHz >= CY_PRA_ECO_FREQ_MIN) && (devConfig->ecoFreqHz <= CY_PRA_ECO_FREQ_MAX)) /* legal range of ECO frequecy is [16.0000-35.0000] */
            && ((devConfig->ecoLoad >= CY_PRA_ECO_CSM_MIN) && (devConfig->ecoLoad <= CY_PRA_ECO_CSM_MAX)) /* ECO cLoad range [1 - 100] */
            && ((devConfig->ecoEsr >= CY_PRA_ECO_ESR_MIN) && (devConfig->ecoEsr <= CY_PRA_ECO_ESR_MAX)) /* ECO ESR range [1 - 1000] */
            && ((devConfig->ecoDriveLevel >= CY_PRA_ECO_DRV_MIN) && (devConfig->ecoDriveLevel <= CY_PRA_ECO_DRV_MAX))) /* ECO Drive Level range [1 - 1000] */
        {
            retStatus = CY_PRA_STATUS_SUCCESS;
        }
        else
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_ECO;
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateExtClkConfig
****************************************************************************//**
*
* Validate External Clocks in respect to provisioned data
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration.
* CY_PRA_STATUS_INVALID_EXTCLK_PROVISION for invalid EXTCLK input configuration.
* CY_PRA_STATUS_INVALID_ECO_PROVISION for invalid ECO input configuration.
* CY_PRA_STATUS_INVALID_WCO_PROVISION for invalid WCO input configuration.
* CY_PRA_STATUS_ERROR_PROCESSING_EXTCLK_PROVISION if failed to process provisioned data
* or devConfig is NULL.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateExtClkConfig(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t clkStatus, retStatus = CY_PRA_STATUS_SUCCESS;
    cy_en_clkpath_in_sources_t hf0SourceClk;

    hf0SourceClk = Cy_PRA_GetInputSourceClock((uint32_t) devConfig->hf0Source, devConfig, &clkStatus);
    if (clkStatus != CY_PRA_STATUS_SUCCESS)
    {
        retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
    }
    else
    {
        /* check for provision data only if External clock source to HF0 */
        switch (hf0SourceClk)
        {
            case CY_SYSCLK_CLKPATH_IN_EXT:
            {
                if ((NULL == extClkPolicyPtr) ||
                (!((extClkPolicyPtr->extClkEnable) &&
                (extClkPolicyPtr->extClkFreqHz == devConfig->extClkFreqHz) &&
                (extClkPolicyPtr->extClkPort   == devConfig->extClkPort) &&
                (extClkPolicyPtr->extClkPinNum == devConfig->extClkPinNum) &&
                (HSIOM_SEL_ACT_4  == devConfig->extClkHsiom)))) /* HSIOM_SEL_ACT_4 is Digital Active
                                                                 * port settings for srss.ext_clk, equals to
                                                                 * P0_0_SRSS_EXT_CLK or P0_5_SRSS_EXT_CLK
                                                                 */
                {
                    retStatus = CY_PRA_STATUS_ERROR_PROCESSING_EXTCLK_PROVISION;
                }
            }
            break;
            case CY_SYSCLK_CLKPATH_IN_ECO:
            {
                if ((NULL == extClkPolicyPtr) ||
                (!((extClkPolicyPtr->ecoEnable) &&
                (extClkPolicyPtr->ecoFreqHz     == devConfig->ecoFreqHz) &&
                (extClkPolicyPtr->ecoLoad       == devConfig->ecoLoad) &&
                (extClkPolicyPtr->ecoEsr        == devConfig->ecoEsr)  &&
                (extClkPolicyPtr->ecoDriveLevel == devConfig->ecoDriveLevel) &&
                (extClkPolicyPtr->ecoInPort     == devConfig->ecoInPort) &&
                (extClkPolicyPtr->ecoOutPort    == devConfig->ecoOutPort) &&
                (extClkPolicyPtr->ecoInPinNum   == devConfig->ecoInPinNum) &&
                (extClkPolicyPtr->ecoOutPinNum  == devConfig->ecoOutPinNum))))
                {
                    retStatus = CY_PRA_STATUS_ERROR_PROCESSING_ECO_PROVISION;
                }
            }
            break;
            case CY_SYSCLK_CLKPATH_IN_WCO:
            {
                if ((NULL == extClkPolicyPtr) ||
                (!((extClkPolicyPtr->wcoEnable) &&
                (extClkPolicyPtr->bypassEnable == devConfig->bypassEnable) &&
                (extClkPolicyPtr->wcoInPort    == devConfig->wcoInPort) &&
                (extClkPolicyPtr->wcoOutPort   == devConfig->wcoOutPort) &&
                (extClkPolicyPtr->wcoInPinNum  == devConfig->wcoInPinNum) &&
                (extClkPolicyPtr->wcoOutPinNum == devConfig->wcoOutPinNum))))
                {
                    retStatus = CY_PRA_STATUS_ERROR_PROCESSING_WCO_PROVISION;
                }
            }
            break;
            default:
            /* None of the external clocks are source to HF0. So skipping validation for provisioning */
            break;
        } /* end switch case */
    } /* end if (clkStatus != CY_PRA_STATUS_SUCCESS) */

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateEXTClk
****************************************************************************//**
*
* Validates External Clock Source.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_EXTCLK For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateEXTClk(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t maxFreq;

