RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    /* For ULP mode, Fextclk_max = 50 MHz. For LP mode, Fextclk_max = 100 MHz or Fcpu_max (if Fcpu_max < 100 MHz) */
    if (devConfig->extClkEnable)
    {
        if (devConfig->ulpEnable)
        {
            if (devConfig->extClkFreqHz > CY_PRA_ULP_MODE_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
            }
        }
        else
        {
            CY_MISRA_FP_LINE('MISRA C-2012 Rule 14.3','CY_HF_CLK_MAX_FREQ varies based on target device and this statement may not be always true.');
            (CY_HF_CLK_MAX_FREQ > CY_PRA_LP_MODE_MAX_FREQUENCY) ? (maxFreq = CY_PRA_LP_MODE_MAX_FREQUENCY) : (maxFreq = CY_HF_CLK_MAX_FREQ);
            if (devConfig->extClkFreqHz > maxFreq)
            {
                return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
            }
        } /*usingULP*/

        /* GPIO port cannot be NULL */
        if (devConfig->extClkPort == NULL)
        {
            return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

#if defined(CY_IP_MXBLESS)

/*******************************************************************************
* Function Name: Cy_PRA_ValidateAltHf
****************************************************************************//**
*
* Validates Alternative High-Frequency Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_ALTHF For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateAltHf(const cy_stc_pra_system_config_t *devConfig)
{

    if (devConfig->clkAltHfEnable)
    {
        uint32_t startupTime;
        /* Validates the frequency */
        if (devConfig->altHFclkFreq > (uint32_t)CY_BLE_BLESS_ECO_FREQ_32MHZ)
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Startup Time */
        startupTime = devConfig->altHFxtalStartUpTime << 5U;
        if ((startupTime < CY_PRA_ALTHF_MIN_STARTUP_TIME) || (startupTime > CY_PRA_ALTHF_MAX_STARTUP_TIME))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Load Cap Range min="7.5 -> 0U" max="26.325 -> 251U" */
        if (devConfig->altHFcLoad > ((uint32_t)CY_PRA_ALTHF_MAX_LOAD))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Validates the clock divider */
        if (devConfig->altHFsysClkDiv > ((uint32_t)CY_BLE_SYS_ECO_CLK_DIV_8))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
    }
    return CY_PRA_STATUS_SUCCESS;
}
#endif /* CY_IP_MXBLESS */

/*******************************************************************************
* Function Name: Cy_PRA_ValidateFLL
****************************************************************************//**
*
* Validates the Frequency Locked Loop (FLL).
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_FLL For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateFLL(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;

    /* Validates FLL only when its state changes Disable -> Enable */
    if ((!Cy_SysClk_FllIsEnabled()) && (devConfig->fllEnable))
    {
        /* FLL is always sourced from PATH_MUX0 */
        /* If FLL is sourced from ILO, PILO or any external clock, then FLL output cannot source
         * to HF0. HF0 validation will check that. */
        if (devConfig->path0Enable)
        {
            /* The source clock for the FLL valid range is 1 kHz - 100 MHz */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
            if ((srcFreq < CY_PRA_FLL_SRC_MIN_FREQUENCY) || (srcFreq > CY_PRA_FLL_SRC_MAX_FREQUENCY))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }

            /* For ULP mode, the out frequency range is 24 - 50 MHz */
            /* For LP mode, theout frequency range is 24 - 100 MHz */
            if (devConfig->ulpEnable)
            {
                if ((devConfig->fllOutFreqHz < CY_PRA_FLL_OUT_MIN_FREQUENCY) || (devConfig->fllOutFreqHz > CY_PRA_FLL_ULP_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM_FLL0;
                }
            }
            else
            {
                CY_MISRA_FP_LINE('MISRA C-2012 Rule 14.3','CY_HF_CLK_MAX_FREQ varies based on target device and this statement may not be always true.');
                if ((devConfig->fllOutFreqHz < CY_PRA_FLL_OUT_MIN_FREQUENCY) || (devConfig->fllOutFreqHz > CY_PRA_FLL_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM_FLL0;
                }
            } /*usingULP*/

            /* Validates multiplier min="1" max="262143" */
            if ((devConfig->fllMult < CY_PRA_FLL_MIN_MULTIPLIER) || (devConfig->fllMult > CY_PRA_FLL_MAX_MULTIPLIER))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* Validates reference min="1" max="8191" */
            if ((devConfig->fllRefDiv < CY_PRA_FLL_MIN_REFDIV) || (devConfig->fllRefDiv > CY_PRA_FLL_MAX_REFDIV))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* ccoRange */
            if (devConfig->fllCcoRange > CY_SYSCLK_FLL_CCO_RANGE4)
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* lockTolerance min="0" max="511" */
            if (devConfig->lockTolerance > CY_PRA_FLL_MAX_LOCK_TOLERENCE)
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->igain > (SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Msk >> SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->pgain > (SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Msk >> SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->settlingCount > (SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Msk >> SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->ccoFreq > (SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Msk >> SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }

            /* devConfig->fllOutFreqHz can be compared with calculated FLL output value with % of accuracy - DRIVERS-3751 */

