RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
            return CY_PRA_STATUS_SUCCESS;
        }
        else
        {
            return CY_PRA_STATUS_INVALID_PARAM_FLL0;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidatePLL
****************************************************************************//**
*
* Validates Phase Locked Loop (PLL).
*
* \param devConfig System Configuration Parameter
* \param pll The PLL number.
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidatePLL(const cy_stc_pra_system_config_t *devConfig, uint8_t pll)
{
    uint32_t srcFreq, outFreq, minDesiredOutFreq;
    bool pllEnable, pathEnable, lowFreqMode;
    cy_en_clkpath_in_sources_t pathSrc;

    if ((pll == CY_PRA_DEFAULT_ZERO) || (pll > CY_SRSS_NUM_PLL))
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    if (pll == CY_PRA_CLKPLL_1)
    {
        pllEnable = devConfig->pll0Enable;
        pathEnable = devConfig->path1Enable;
        pathSrc = devConfig->path1Src;
        outFreq = devConfig->pll0OutFreqHz;
        lowFreqMode = devConfig->pll0LfMode;
    }
    else if (pll == CY_PRA_CLKPLL_2)
    {
        pllEnable = devConfig->pll1Enable;
        pathEnable = devConfig->path2Enable;
        pathSrc = devConfig->path2Src;
        outFreq = devConfig->pll1OutFreqHz;
        lowFreqMode = devConfig->pll1LfMode;
    }
    else
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    /* If PLL is sourced from ILO, PILO, or any external clock, then the PLL output cannot source
     * to HF0. This check is performed at HF0 validation */
    if (pllEnable)
    {
        if (pathEnable)
        {
            /* The PLL source clock valid range is 4 MHz - 64 MHz */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(pathSrc, devConfig);
            if ((srcFreq < CY_PRA_PLL_SRC_MIN_FREQUENCY) || (srcFreq > CY_PRA_PLL_SRC_MAX_FREQUENCY))
            {
                return CY_PRA_STATUS_INVALID_PARAM;
            }

            /* If Low frequency mode is enabled, the PLL minimum output frequency is 10.625 MHz otherwise 12.5 MHz */
            (lowFreqMode) ? (minDesiredOutFreq = CY_PRA_PLL_LOW_OUT_MIN_FREQUENCY) : (minDesiredOutFreq = CY_PRA_PLL_OUT_MIN_FREQUENCY);
            /* For ULP mode, the out frequency is < 50 MHz */
            /* For LP mode, the out frequency is < CY_HF_CLK_MAX_FREQ */
            if (devConfig->ulpEnable)
            {
                if ((outFreq < minDesiredOutFreq) || (outFreq > CY_PRA_PLL_ULP_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM;
                }
            }
            else
            {
                if ((outFreq < minDesiredOutFreq) || (outFreq > CY_PRA_PLL_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM;
                }
            } /*usingULP*/

            /* Checks the PLL output frequency */
            if (outFreq != Cy_PRA_CalculatePLLOutFreq(pll, devConfig))
            {
                return CY_PRA_STATUS_INVALID_PARAM;
            }
        }
        else
        {
            return CY_PRA_STATUS_INVALID_PARAM;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateAllPLL
****************************************************************************//**
*
* Validates All Phase Locked Loop (PLL).
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_PLL0 For the PLLO invalid parameter.
* CY_PRA_STATUS_INVALID_PARAM_PLL1 For the PLL1 invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateAllPLL(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    /* PLL0 is always sourced from PATH_MUX1 */
    if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (devConfig->pll0Enable))
    {
        /* Validates PLL1 only when its state changes Disable -> Enable */
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1))
        {
            retStatus = Cy_PRA_ValidatePLL(devConfig, CY_PRA_CLKPLL_1);
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_PLL0;
        }
    }
    /* PLL1 is always sourced from PATH_MUX2 */
    if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (devConfig->pll1Enable) && (retStatus == CY_PRA_STATUS_SUCCESS))
    {
        /* Validates PLL2 only when its state changes Disable -> Enable */
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2))
        {
            retStatus = Cy_PRA_ValidatePLL(devConfig, CY_PRA_CLKPLL_2);
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_PLL1;
        }
    }
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkLf
****************************************************************************//**
*
* Validates Low-Frequency Clock (CLK_LF).
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_CLKLF For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkLf(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    /* output frequency = input frequency [range min="0" max="100000"] */
    if (devConfig->clkLFEnable)
    {
        switch (devConfig->clkLfSource)
        {
            case CY_SYSCLK_CLKLF_IN_ILO:
            {
                (devConfig->iloEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            case CY_SYSCLK_CLKLF_IN_WCO:
            {
                (devConfig->wcoEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            case CY_SYSCLK_CLKLF_IN_PILO:
            {
                ((devConfig->piloEnable) && (CY_SRSS_PILO_PRESENT)) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            default:
            {
                retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF;
            }
            break;
        } /* End of Switch */
    }

