RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkHfFreqDiv
****************************************************************************//**
*
* Validates the High Frequency Clock's output frequency and divider.
*
* \param outFreqMHz Output frequency
* \param divider Frequency divider
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkHfFreqDiv(uint32_t outFreqMHz, cy_en_clkhf_dividers_t divider)
{
    /* min="1" max="CY_HF_CLK_MAX_FREQ" */
    if ((outFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION) > CY_HF_CLK_MAX_FREQ)
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }
    if (divider > CY_SYSCLK_CLKHF_DIVIDE_BY_8)
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkHFs
****************************************************************************//**
*
* Validates All High Frequency Clocks.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKHF0 for bad parameter for HF0
* CY_PRA_STATUS_INVALID_PARAM_CLKHF1 for bad parameter for HF1
* CY_PRA_STATUS_INVALID_PARAM_CLKHF2 for bad parameter for HF2
* CY_PRA_STATUS_INVALID_PARAM_CLKHF3 for bad parameter for HF3
* CY_PRA_STATUS_INVALID_PARAM_CLKHF4 for bad parameter for HF4
* CY_PRA_STATUS_INVALID_PARAM_CLKHF5 for bad parameter for HF5
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkHFs(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_clkpath_in_sources_t clkSource;
    cy_en_pra_status_t status;
    uint32_t freq;

    /* Validates HF0 */
    if ((devConfig->clkHF0Enable) && (CY_PRA_CLKHF_0 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf0Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }

        /* ILO, PILO and ALTHF can't be source to HF0  */
        clkSource = Cy_PRA_GetInputSourceClock((uint32_t) devConfig->hf0Source, devConfig, &status);
        if ((clkSource == CY_SYSCLK_CLKPATH_IN_ILO) ||
            (clkSource == CY_SYSCLK_CLKPATH_IN_PILO) ||
            (clkSource == CY_SYSCLK_CLKPATH_IN_ALTHF) ||
            (status != CY_PRA_STATUS_SUCCESS))
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
            }

        /* HF0: the input source cannot be slower than legal min 200 kHz */
        status = Cy_PRA_GetInputSourceFreq((uint32_t) devConfig->hf0Source, devConfig, &freq);
        if ((freq < CY_PRA_HF0_MIN_FREQUENCY) || (status != CY_PRA_STATUS_SUCCESS))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }

        /* Validates the output frequency and divider */
        /* The HF0 output frequency cannot be 0 MHz because the current LF
         * clocks are not allowed to source HF0 */
        if ((devConfig->hf0OutFreqMHz == 0UL) || (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf0OutFreqMHz, devConfig->hf0Divider)))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }
    }
    else
    {
        /* This cannot be disabled */
        return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
    }

    /* Validates HF1 */
    if ((devConfig->clkHF1Enable) && (CY_PRA_CLKHF_1 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf1Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
        /* Validates the output frequency and divider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf1OutFreqMHz, devConfig->hf1Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
    }

    /* Validates HF2 */
    if ((devConfig->clkHF2Enable) && (CY_PRA_CLKHF_2 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf2Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }

        /* Validates the output frequency and divider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf2OutFreqMHz, devConfig->hf2Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }
    }

    /* Validates HF3 */
    if ((devConfig->clkHF3Enable) && (CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf3Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
        }

        /* Validates the output frequency and divider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf3OutFreqMHz, devConfig->hf3Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
        }
    }

    /* Validates HF4 */
    if ((devConfig->clkHF4Enable) && (CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf4Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
        }

        /* Validates the output frequency and divider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf4OutFreqMHz, devConfig->hf4Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
        }
    }

    /* Validates HF5 */
    if ((devConfig->clkHF5Enable) && (CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT))
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf5Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
        }

        /* Validates the output frequency and divider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf5OutFreqMHz, devConfig->hf5Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
        }
    }

