RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPump
****************************************************************************//**
*
* Validates the PUMP Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_CLKPUMP For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPump(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;
    cy_en_pra_status_t status = CY_PRA_STATUS_SUCCESS;
    /* Validates PUMP */
    if (devConfig->clkPumpEnable)
    {
        /* The input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->pumpSource, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }

        /* Validates the  divider */
        if (devConfig->pumpDivider > CY_SYSCLK_PUMP_DIV_16)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }

        /* the output frequency range is min="0" max="400000000" */
        status = Cy_PRA_GetInputSourceFreq((uint32_t) devConfig->pumpSource,devConfig, &freq);
        if( status == CY_PRA_STATUS_SUCCESS )
        {
            freq = freq / (1UL << ((uint32_t)devConfig->pumpDivider)); /* Calculates the output frequency */
            if (freq > CY_PRA_PUMP_OUT_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
            }
        }
        else
        {
            status = CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkBak
****************************************************************************//**
*
* Validates Backup Domain Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKBAK for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkBak(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;
    uint32_t freq;

    if (devConfig->clkBakEnable)
    {
        /* If CLK_BAK is enabled, the source clock, either CLK_LF or CLK_WCO,
         * must be enabled */
        switch (devConfig->clkBakSource)
        {
            case CY_SYSCLK_BAK_IN_WCO:
            {
                (devConfig->wcoEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK);
            }
            break;
            case CY_SYSCLK_BAK_IN_CLKLF:
            {
                (devConfig->clkLFEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK);
            }
            break;
            default:
            {
                retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK;
            }
            break;
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            return retStatus;
        }

        /* Validates Output Frequency min="0" max="100000" */
        /* There is no divider for CLK_BAK. So, output frequency = input frequency */
        freq = Cy_PRA_GetClkBakFreq(devConfig);
        if (freq > CY_PRA_BAK_OUT_MAX_FREQUENCY)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK;
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkFast
****************************************************************************//**
*
* Validate Fast Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_CLKFAST For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkFast(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* The HF0 source clock must be enabled */
    if (devConfig->clkFastEnable)
    {
        if (!(devConfig->clkHF0Enable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKFAST;
        }

        /* Validates the frequency range. min="0" max="400000000" */
        freq = Cy_PRA_GetHF0FreqHz(devConfig); /* input frequency */
        freq = freq / (devConfig->clkFastDiv+1UL); /* Calculate Output frequency */
        if (freq > CY_PRA_FAST_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKFAST;
        }

        /* Validates divider min="1" max="256". The user must pass actual divider-1 */
        /* No need to validate the divider because the max value input cannot be more than 255 */
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPeri
****************************************************************************//**
*
* Validate Peripheral Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPeri(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* The HF0 source clock must be enabled */
    if (devConfig->clkPeriEnable)
    {
        if (!(devConfig->clkHF0Enable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = Cy_PRA_GetHF0FreqHz(devConfig); /* input frequency */
        if (freq > CY_HF_CLK_MAX_FREQ)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = freq / (devConfig->clkPeriDiv+1UL); /* Calculate Output frequency */

        /* Maximum 25 MHz for ULP mode and 100 MHz for LP mode */
        if (devConfig->ulpEnable)
        {
            if (freq > CY_PRA_ULP_MODE_HF0_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
            }
        }
        else
        {
            if (freq > CY_PRA_LP_MODE_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
            }
        }

        /* Validates divider min="1" max="256". The user must pass actual divider-1 */
        /* No need to validate the divider because the max value input cannot be more than 255 */
    }
    else
    {
        /* Checks if this clock is always on */
        return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
    }

