RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkTimer
****************************************************************************//**
*
* Validates Timer Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkTimer(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;
    uint8_t srcDiv;
    cy_en_pra_status_t ret = CY_PRA_STATUS_SUCCESS;

    /* The source clock must be enabled */
    if (devConfig->clkTimerEnable)
    {
        /* Calculates the source frequency and divider */
        switch (devConfig->clkTimerSource)
        {
            case CY_SYSCLK_CLKTIMER_IN_IMO:
            {
                /* IMO is always on */
                freq = CY_PRA_IMO_SRC_FREQUENCY; /* 8 MHz */
                srcDiv = CY_PRA_DIVIDER_1;
                break;
            }
            case CY_SYSCLK_CLKTIMER_IN_HF0_NODIV:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV2:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV4:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV8:
            {
                if ( devConfig->clkHF0Enable )
                {
                    srcDiv = CY_PRA_DIVIDER_1;
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV2)
                    {
                        srcDiv = CY_PRA_DIVIDER_2;
                    }
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV4)
                    {
                        srcDiv = CY_PRA_DIVIDER_4;
                    }
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV8)
                    {
                        srcDiv = CY_PRA_DIVIDER_8;
                    }
                    freq = Cy_PRA_GetHF0FreqHz(devConfig);
                }
                else
                {
                    ret = CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
                }
                break;
            }
            default:
            {
                ret = CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
                break;
            }
        }

        if(ret != CY_PRA_STATUS_SUCCESS)
        {
            return ret;
        }

        /* Output frequency = source frequency / divider */
        freq = (freq / (devConfig->clkTimerDivider + 1UL)) / srcDiv;
        /* Output frequency range min="0" max="400000000" */
        if (freq > CY_PRA_TIMER_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkSlow
****************************************************************************//**
*
* Validates Slow Clock.
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI For the invalid parameter.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkSlow(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* The source clock must be enabled */
    if (devConfig->clkSlowEnable)
    {
        if (!(devConfig->clkPeriEnable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
        }

        /* outFreq = (sourceFreq / divider) range is min="0" max="400000000" */
        freq = Cy_PRA_GetHF0FreqHz(devConfig); /* input frequency */
        if (freq > CY_HF_CLK_MAX_FREQ)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = freq / (devConfig->clkPeriDiv+1UL); /* Calculates the output frequency for PERI and input frequency for SLOW_CLK */

        freq = freq / (devConfig->clkSlowDiv+1UL); /* Output CLK_SLOW frequency */

        if (freq > CY_PRA_SLOW_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
        }
    }
    else
    {
        /* Checks if this clock is always on */
        return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateSystemConfig
****************************************************************************//**
*
* Validate System Configuration
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS For the valid input configuration.
* CY_PRA_STATUS_INVALID_PARAM Generic failure in validation.
* CY_PRA_STATUS_INVALID_PARAM_ECO Error in ECO validation.
* CY_PRA_STATUS_INVALID_PARAM_EXTCLK Error in EXTCLK validation.
* CY_PRA_STATUS_INVALID_PARAM_ALTHF Error in ALTHF validation.
* CY_PRA_STATUS_INVALID_PARAM_ILO Error in ILO validation.
* CY_PRA_STATUS_INVALID_PARAM_PILO Error in PILO validation.
* CY_PRA_STATUS_INVALID_PARAM_WCO Error in WCO validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX0 Error in PATHMUX0 validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX1 Error in PATHMUX1 validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX2 Error in PATHMUX2 validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX3 Error in PATHMUX3 validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX4 Error in PATHMUX4 validation.
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX5 Error in PATHMUX5 validation.
* CY_PRA_STATUS_INVALID_PARAM_FLL0 Error in FLL validation.
* CY_PRA_STATUS_INVALID_PARAM_PLL0 Error in PLL0 validation.
* CY_PRA_STATUS_INVALID_PARAM_PLL1 Error in PLL1 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKLF Error in CLKLF validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF0 Error in CLKHF0 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF1 Error in CLKHF1 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF2 Error in CLKHF2 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF3 Error in CLKHF3 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF4 Error in CLKHF4 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKHF5 Error in CLKHF5 validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKPUMP Error in CLKPUMP validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKBAK Error in CLKBAK validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKFAST Error in CLKFAST validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI Error in CLKPERI validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKSLOW Error in CLKSLOW validation.
* CY_PRA_STATUS_INVALID_PARAM_CLKTIMER Error in CLKTIMER validation.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateSystemConfig(const cy_stc_pra_system_config_t *devConfig)
{

     cy_en_pra_status_t retStatus;

    if (devConfig == NULL )
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    /* Validates IMO */
    /* Enables IMO for proper chip operation. So, the user option is not given for IMO.
     * The output frequency of IMO is fixed to 8MHz.
     */

    /* Validate external clock with provisioned data */
    retStatus = Cy_PRA_ValidateExtClkConfig(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

