RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
     /* Validates ECO */
    retStatus = Cy_PRA_ValidateECO(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates EXTCLK */
    retStatus = Cy_PRA_ValidateEXTClk(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates ALTHF (BLE ECO) */
#if defined(CY_IP_MXBLESS)
    retStatus = Cy_PRA_ValidateAltHf(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }
#endif

    /* Validates ILO */
    /* ILO frequency fixed to 32KHz */

    /* Validate PILO */
    /* The PILO frequency is fixed to 32.768KHz */

    /* Validates WCO */
    /* The WCO frequency is fixed to 32.768KHz */

    /* Validates Path Mux */
    retStatus = Cy_PRA_ValidateAllClkPathMux(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates FLL */
    /* For ULP mode, Ffll_max = 50 MHz. For LP mode, Ffll_max = 100 MHz or Fcpu_max (if Fcpu_max < 100 MHz) */
    retStatus = Cy_PRA_ValidateFLL(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates PLLs */
    retStatus = Cy_PRA_ValidateAllPLL(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_LF */
    retStatus = Cy_PRA_ValidateClkLf(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_HF */
    retStatus = Cy_PRA_ValidateClkHFs(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_PUMP */
    retStatus = Cy_PRA_ValidateClkPump(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_BAK */
    retStatus = Cy_PRA_ValidateClkBak(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_FAST */
    retStatus = Cy_PRA_ValidateClkFast(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_PERI */
    retStatus = Cy_PRA_ValidateClkPeri(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validates CLK_TIMER */
    retStatus = Cy_PRA_ValidateClkTimer(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_SLOW */
    retStatus = Cy_PRA_ValidateClkSlow(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

     return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_CalculateFLLOutFreq
****************************************************************************//**
*
* Calculates and returns the FLL output frequency.
*
* \param devConfig System Configuration Parameter
*
* \return
* The FLL output frequency.
*
*******************************************************************************/
uint32_t Cy_PRA_CalculateFLLOutFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;
    uint32_t outFreq=0UL;

    /* Gets the input source frequency to FLL */
    srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
    if ((srcFreq != CY_PRA_DEFAULT_SRC_FREQUENCY) && (devConfig->fllRefDiv != 0UL))
    {
        outFreq = ((srcFreq * devConfig->fllMult) / devConfig->fllRefDiv) / (devConfig->enableOutputDiv ? 2UL : 1UL);
    }

    return outFreq;
}

/*******************************************************************************
* Function Name: Cy_PRA_CalculatePLLOutFreq
****************************************************************************//**
*
* Calculates and returns the PLL output frequency.
*
* \param pll       PLL number
* \param devConfig System Configuration Parameter
*
* \return
* The PLL output frequency.
*
*******************************************************************************/
uint32_t Cy_PRA_CalculatePLLOutFreq(uint8_t pll, const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;
    uint32_t outFreq;
    uint32_t feedback;
    uint32_t reference;
    uint32_t pllOutputDiv;

    if ((pll > CY_PRA_DEFAULT_ZERO) && (pll <= CY_SRSS_NUM_PLL)) /* 0 is invalid pll number */
    {
        if (pll == CY_PRA_CLKPLL_1)
        {
            /* Gets the input source frequency to PLL1 */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path1Src, devConfig);
            feedback = devConfig->pll0FeedbackDiv;
            reference = devConfig->pll0ReferenceDiv;
            pllOutputDiv = devConfig->pll0OutputDiv;
        }
        else if (pll == CY_PRA_CLKPLL_2)
        {
            /* Gets the input source frequency to PLL2 */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path2Src, devConfig);
            feedback = devConfig->pll1FeedbackDiv;
            reference = devConfig->pll1ReferenceDiv;
            pllOutputDiv = devConfig->pll1OutputDiv;
        }
        else
        {
            srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }

        if ((srcFreq != CY_PRA_DEFAULT_SRC_FREQUENCY) && (reference != CY_PRA_DIVIDER_0) && (pllOutputDiv != CY_PRA_DIVIDER_0))
        {
            outFreq = ((srcFreq * feedback) / reference) / pllOutputDiv;
        }
        else
        {
            outFreq = CY_PRA_DEFAULT_ZERO;
        }
    }
    else
    {
        outFreq = CY_PRA_DEFAULT_ZERO;
    }

    return outFreq;
}

#endif /* (CY_CPU_CORTEX_M0P) */

/*
* Delay of 4 WCO clock cycles. This delay is used before the WCO is disabled.
* 1 WCO cycle is 30.5 uS.
*/
#define WCO_DISABLE_DELAY_US    (123U)

/*
* Delay of 4 ILO clock cycles. This delay is used before the ILO is disabled.
* 1 ILO cycle is 40.6 uS. This is a worst case for ILO which is 32 kHz +/- 30%.
*/
#define ILO_DISABLE_DELAY_US    (163U)

/*******************************************************************************
* Function Name: Cy_PRA_SystemConfig
****************************************************************************//**
*
* Validates \ref cy_stc_pra_system_config_t and applies the provided
* settings.
*
* \param devConfig The device configuration structure initialized with
* Device Configurator.
*
* \return \ref cy_en_pra_status_t
*
* \funcusage
* \snippet pra/snippet/main.c snippet_Cy_PRA_SystemConfig
*
*******************************************************************************/
cy_en_pra_status_t Cy_PRA_SystemConfig(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t status;

#if (CY_CPU_CORTEX_M4)
    (void) devConfig;
    status = CY_PRA_STATUS_SUCCESS;
#else

    cy_en_sysclk_status_t sysClkStatus;

    /* Validates the input parameters */
    status = Cy_PRA_ValidateSystemConfig(devConfig);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Sets the worst case memory wait states (! ultra low power, 150 MHz), update - at the end */
    Cy_SysLib_SetWaitStates(false, CY_PRA_150MHZ_FREQUENCY);

    if (devConfig->powerEnable)
    {
        status = Cy_PRA_PowerInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

    if(CY_SRSS_PILO_PRESENT)
    {
        /* Enables all source clocks */
        if (Cy_SysClk_PiloIsEnabled())
        {
            if (!devConfig->piloEnable)
            {
                Cy_SysClk_PiloDisable();
            }
        }
        /* When the PILO state changes DISABLE -> ENABLE, enable only PILO.
         * Ignore, if PILO is already enabled */
        else
        {
            if (devConfig->piloEnable)
            {
                SystemCoreClockUpdate();
                Cy_PRA_PiloInit();
            }
        }
    }

    if (_FLD2BOOL(BACKUP_CTL_WCO_EN, BACKUP_CTL))
    {
        if (!devConfig->wcoEnable)
        {
            /* Wait 4 WCO cycles before it is disabled */
            Cy_SysLib_DelayUs(WCO_DISABLE_DELAY_US);
            Cy_SysClk_WcoDisable();
        }
    }
    /* When the WCO state changes DISABLE -> ENABLE, enable only WCO.
     * Ignore, if WCO is already enabled */
    else
    {
        if (devConfig->wcoEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_WcoInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    if (devConfig->clkLFEnable)
    {
        status = Cy_PRA_ClkLfInit(devConfig->clkLfSource);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

#if defined(CY_IP_MXBLESS)
    if (Cy_BLE_EcoIsEnabled())
    {
        if (!devConfig->clkAltHfEnable)
        {
            Cy_BLE_EcoReset();
        }
    }
    /* When the BLE_ECO state changes DISABLE -> ENABLE, enable only BLE_ECO.
     * Ignore, if BLE_ECO is already enabled */
    else
    {
        if (devConfig->clkAltHfEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_AltHfInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }
#endif /* CY_IP_MXBLESS */

    if(CY_SYSCLK_ECOSTAT_STABLE == Cy_SysClk_EcoGetStatus())
    {
        if (!devConfig->ecoEnable)
        {
            Cy_SysClk_EcoDisable();
        }
    }
    /* When the ECO state changes DISABLE -> ENABLE, enable only ECO.
     * Ignore, if ECO is already enabled */
    else
    {
        if (devConfig->ecoEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_EcoInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    if (devConfig->extClkEnable)
    {
        Cy_PRA_ExtClkInit(devConfig);
    }

    if (devConfig->clkFastEnable)
    {
        Cy_SysClk_ClkFastSetDivider(devConfig->clkFastDiv);
    }

    if (devConfig->clkPeriEnable)
    {
        Cy_SysClk_ClkPeriSetDivider(devConfig->clkPeriDiv);
    }

    if (devConfig->clkSlowEnable)
    {
        Cy_SysClk_ClkSlowSetDivider(devConfig->clkSlowDiv);
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) &&
        (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        /* Configure HFCLK0 to temporarily run from IMO to initialize other clocks */
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, CY_SYSCLK_CLKPATH_IN_IMO);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
        sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
        }
    }
    else
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
    }

    /* Configures Path Clocks */

    if (devConfig->path0Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_0, devConfig->path0Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
        }
    }

