RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    if (devConfig->path2Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_2, devConfig->path2Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX2;
        }
    }

    if ((devConfig->path3Enable) && (CY_PRA_CLKPATH_3 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_3, devConfig->path3Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX3;
        }
    }

    if ((devConfig->path4Enable) && (CY_PRA_CLKPATH_4 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_4, devConfig->path4Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX4;
        }
    }

    if ((devConfig->path5Enable) && (CY_PRA_CLKPATH_5 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_5, devConfig->path5Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX5;
        }
    }

    if(Cy_SysClk_FllIsEnabled())
    {
        uint32_t oldFreq, newFreq;
        oldFreq = Cy_SysClk_FllGetFrequency();
        newFreq = Cy_PRA_CalculateFLLOutFreq(devConfig);
        /* Disables FLL when its state changes ENABLE -> DISABLE or FLL configuration changed */
        if ((!(devConfig->fllEnable)) || /* state change from ENABLE -> DISABLE */
            (oldFreq != newFreq)) /* fll configuration is changed */
        {
            sysClkStatus = Cy_SysClk_FllDisable();

            if (CY_SYSCLK_SUCCESS != sysClkStatus)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
            }
        }
    }

    /* When the FLL state changes DISABLE -> ENABLE, then only enable FLL.
     * Ignore, if FLL is already enabled
     */
    if((devConfig->fllEnable) && (!Cy_SysClk_FllIsEnabled()))
    {
        SystemCoreClockUpdate();
        status = Cy_PRA_FllInit(devConfig);

        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }


    /* CLK_HF0 Init */
    sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, devConfig->hf0Source);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, devConfig->hf0Divider);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) && (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        if (devConfig->path1Enable)
        {
            sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
            if (CY_SYSCLK_SUCCESS != sysClkStatus)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
            }
        }
        else
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }

    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1)
    {
        if(Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1))
        {
            uint32_t oldFreq, newFreq;
            oldFreq = Cy_SysClk_PllGetFrequency(CY_PRA_CLKPLL_1);
            newFreq = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_1, devConfig);
            /* Disables PLL0 when its state changes ENABLE -> DISABLE or PLL configuration changed */
            if ((!devConfig->pll0Enable) ||  /* state change from ENABLE -> DISABLE */
                (oldFreq != newFreq)) /* pll1 configuration is changed */
            {
                SystemCoreClockUpdate();
                sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_1);

                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
                }
            }
        }
        /* When the PLL0 state changes DISABLE -> ENABLE, enable only PLL0.
         * Ignore, if PLL0 is already enabled */

        if((devConfig->pll0Enable) && (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1)))
        {
            const cy_stc_pll_manual_config_t pll0Config =
            {
                .feedbackDiv = devConfig->pll0FeedbackDiv,
                .referenceDiv = devConfig->pll0ReferenceDiv,
                .outputDiv = devConfig->pll0OutputDiv,
                .lfMode = devConfig->pll0LfMode,
                .outputMode = devConfig->pll0OutputMode,
            };

            SystemCoreClockUpdate();
            status = Cy_PRA_PllInit(CY_PRA_CLKPLL_1, &pll0Config);

            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
            }
        }
    }

    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2)
    {
        if(Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2))
        {
            uint32_t oldFreq, newFreq;
            oldFreq = Cy_SysClk_PllGetFrequency(CY_PRA_CLKPLL_2);
            newFreq = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_2, devConfig);
            /* Disables PLL0 when its state changes ENABLE -> DISABLE or PLL configuration changed */
            if ((!devConfig->pll1Enable) ||  /* state change from ENABLE -> DISABLE */
                (oldFreq != newFreq)) /* pll2 configuration is changed */
            {
                SystemCoreClockUpdate();
                sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_2);

                if (CY_SYSCLK_SUCCESS != sysClkStatus)
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
                }
            }
        }
        /* When the PLL1 state changes DISABLE -> ENABLE, enable only PLL1.
         * Ignore, if PLL1 is already enabled */

        if((devConfig->pll1Enable) && (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2)))
        {
            const cy_stc_pll_manual_config_t pll1Config =
            {
                .feedbackDiv = devConfig->pll1FeedbackDiv,
                .referenceDiv = devConfig->pll1ReferenceDiv,
                .outputDiv = devConfig->pll1OutputDiv,
                .lfMode = devConfig->pll1LfMode,
                .outputMode = devConfig->pll1OutputMode,
            };

            SystemCoreClockUpdate();
            status = Cy_PRA_PllInit(CY_PRA_CLKPLL_2, &pll1Config);

            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
            }
        }
    }

    /* Configures the HF clocks */
    if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_1))
    {
        if (!devConfig->clkHF1Enable)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_1);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
            }
        }
    }
    else
    {
        if (devConfig->clkHF1Enable)
        {
            status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_1, devConfig->hf1Source, devConfig->hf1Divider);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
            }
        }
    }

    if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_2))
    {
        if (!devConfig->clkHF2Enable)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_2);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
            }
        }
    }
    else
    {
        if (devConfig->clkHF2Enable)
        {
            status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_2, devConfig->hf2Source, devConfig->hf2Divider);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
            }
        }
    }

