RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
    if(CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_3))
        {
            if (!devConfig->clkHF3Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_3);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
                }
            }
        }
        else
        {
            if (devConfig->clkHF3Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_3, devConfig->hf3Source, devConfig->hf3Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
                }
            }
        }
    }

    if (CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_4))
        {
            if (!devConfig->clkHF4Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_4);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
                }
            }
        }
        else
        {
            if (devConfig->clkHF4Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_4, devConfig->hf4Source, devConfig->hf4Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
                }
            }
        }
    }

    if (CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT)
    {
        if (Cy_SysClk_ClkHfIsEnabled(CY_PRA_CLKHF_5))
        {
            if (!devConfig->clkHF5Enable)
            {
                status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_5);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
                }
            }
        }
        else
        {
            if (devConfig->clkHF5Enable)
            {
                status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_5, devConfig->hf5Source, devConfig->hf5Divider);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
                }
            }
        }
    }

    /* Configures miscellaneous clocks */
    if (Cy_SysClk_ClkTimerIsEnabled())
    {
        if (!devConfig->clkTimerEnable)
        {
            Cy_SysClk_ClkTimerDisable();
        }
    }
    /* When the TIMER state changes DISABLE -> ENABLE, enable only TIMER.
     * Ignore, if TIMER is already enabled */
    else
    {
        if (devConfig->clkTimerEnable)
        {
            Cy_PRA_ClkTimerInit(devConfig->clkTimerSource, devConfig->clkTimerDivider);
        }
    }

    if (Cy_SysClk_ClkPumpIsEnabled())
    {
        if (!devConfig->clkPumpEnable)
        {
            Cy_SysClk_ClkPumpDisable();
        }
    }
    /* When the PUMP state changes DISABLE -> ENABLE, enable only PUMP.
     * Ignore, if PUMP is already enabled */
    else
    {
        if (devConfig->clkPumpEnable)
        {
            Cy_PRA_ClkPumpInit(devConfig->pumpSource, devConfig->pumpDivider);
        }
    }

    if (devConfig->clkBakEnable)
    {
        Cy_SysClk_ClkBakSetSource(devConfig->clkBakSource);
    }

    status = Cy_PRA_IloHibernateOn(devConfig->iloHibernateON);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Configures the default-enabled clocks */
    if (Cy_SysClk_IloIsEnabled())
    {
        if (!devConfig->iloEnable)
        {
            /* Wait 4 ILO cycles before it is disabled */
            Cy_SysLib_DelayUs(ILO_DISABLE_DELAY_US);

            status = Cy_PRA_IloDisable();
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }
    /* When the ILO state changes DISABLE -> ENABLE, enable only ILO.
     * Ignore, if ILO is already enabled */
    else
    {
        if (devConfig->iloEnable)
        {
            status = Cy_PRA_IloEnable();
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
    }

    /* SYSCLK MFO INIT */
    /* SYSCLK MF INIT */

    /* Sets accurate flash wait states */
    if ((devConfig->powerEnable) && (devConfig->clkHF0Enable))
    {
        Cy_SysLib_SetWaitStates(devConfig->ulpEnable, devConfig->hf0OutFreqMHz);
    }

    /* Updates the System Core Clock values for the correct Cy_SysLib_Delay functioning.
     * This function is called before every PDL function where the Cy_SysLib_Delay
     * function is used.
     */
    SystemCoreClockUpdate();

#endif /* (CY_CPU_CORTEX_M4) */

    return (status);
}


#if (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_PRA_CloseSrssMain2
****************************************************************************//**
*
* Restricts the access to the SRSS_MAIN2 region, which includes the following
* registers: SRSS_TST_DDFT_SLOW_CTL_REG and SRSS_TST_DDFT_FAST_CTL_REG.
*
* The function is called from \ref Cy_SysPm_CpuEnterDeepSleep() only for
* the PSOC6ABLE2 devices.
*
*******************************************************************************/
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_BEGIN
    #if !defined (__ICCARM__)
        CY_NOINLINE
    #endif
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
void Cy_PRA_CloseSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Turn off PC_MATCH for SRSS fixed PPU */
        uint32_t slaveAtt = PERI_GR_PPU_SL_SRSS->ATT0;
        slaveAtt &= ~PERI_GR_PPU_SL_ATT0_PC_MATCH_Msk;
        PERI_GR_PPU_SL_SRSS->ATT0 = slaveAtt;

        /* Disable programmable PPUs #2 and #3 */
        PERI_PPU_PR_ATT0(PERI_PPU_PR2) &= ~_VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
        PERI_PPU_PR_ATT0(PERI_PPU_PR3) &= ~_VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_END
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */


