RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_pra_cfg.c
/*******************************************************************************
* Function Name: Cy_PRA_OpenSrssMain2
****************************************************************************//**
*
* Restores the access to the SRSS_MAIN2 region, which was restricted by
* Cy_PRA_CloseSrssMain2.
*
* The function is called from \ref Cy_SysPm_CpuEnterDeepSleep() only for
* the CYB06xx7 devices.
*
*******************************************************************************/
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_BEGIN
    #if !defined (__ICCARM__)
        CY_NOINLINE
    #endif
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */
void Cy_PRA_OpenSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Turn on PC_MATCH for SRSS fixed PPU */
        uint32_t slaveAtt = PERI_GR_PPU_SL_SRSS->ATT0;
        slaveAtt |= PERI_GR_PPU_SL_ATT0_PC_MATCH_Msk;
        PERI_GR_PPU_SL_SRSS->ATT0 = slaveAtt;

        /* Enable programmable PPUs #2 and #3 */
        PERI_PPU_PR_ATT0(PERI_PPU_PR2) |= _VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
        PERI_PPU_PR_ATT0(PERI_PPU_PR3) |= _VAL2FLD(PERI_PPU_PR_ATT0_ENABLED, CY_PROT_STRUCT_ENABLE);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}
#if defined(CY_DEVICE_PSOC6ABLE2)
    CY_SECTION_RAMFUNC_END
#endif /* defined(CY_DEVICE_PSOC6ABLE2) */

#endif /* (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN) */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 17.2');

#endif /* (CY_DEVICE_SECURE) */

#endif /* defined (CY_IP_MXS40SRSS) */

/* [] END OF FILE */
